Tekla Open API Reference for Tekla Structures 2025
StructuresDialogAttribute Class
 The StructuresDialogAttribute class specifies the attribute name to which the value of the property will be bound in Tekla Structures.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Dialog.StructuresDialogAttribute
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class StructuresDialogAttribute : Attribute
Public NotInheritable Class StructuresDialogAttribute
	Inherits Attribute
The StructuresDialogAttribute type exposes the following members.
Constructors
Name | Description
StructuresDialogAttribute(String)
 Initializes a new StructuresDialogAttribute instance.
StructuresDialogAttribute(String, String)
 Initializes a new StructuresDialogAttribute instance.
StructuresDialogAttribute(String, Type)
 Initializes a new StructuresDialogAttribute instance.
Top
Properties
Name | Description
AttributeName
 Gets the attribute name of the property.
AttributeType
 Gets the attribute type of the property.
Top
Methods
Name | Description
GetCorrectDialogAttributeType
 Initializes a new StructuresDialogAttribute instance.
ToString
 Returns a string that represents the current StructuresDialogAttribute object.
 (Overrides Object.ToString().)
Top
See Also
Reference
Tekla.Structures.Dialog Namespace